[
    {
        "id": 1,
        "heading": "Summer Intern",
        "company": "MathPickle",
        "description": "While working as a summer intern for MathPickle, I renovated the company website and added several new features including a new landing page, mailing list integration (through MailChimp) and SEO management. Furthermore, I worked with other interns to create marketing videos, build a press kit, and manage social media accounts. MathPickle is a Calgary based startup supported by the American Institute of Mathematics that provides free online resources of original mathematical puzzles, games and unsolved problems for K-12 teachers.",
        "image": "MathPickle.png",
        "url": "https://mathpickle.com/"
    },

    {
        "id": 2,
        "heading": "SHAD Fellow",
        "company": "SHAD",
        "description": "In 2016, I was accepted into SHAD, one of Canada’s most prestigious summer programs for high school students. During the program, I attended lectures focusing on STEM (science, technology, engineering, mathematics) and entrepreneurship topics at the University of Western Ontario. Additionally, I competed in the 2016 SHAD-John Dobson Entrepreneurship Cup, where I worked as a marketing director for HexaGro, a venture that explored the potential of innovative greenhouse technologies for eradicating food insecurity. HexaGro ended up winning the “National Champion in Marketing” award at the Canada-wide competition.",
        "image": "SHAD.png",
        "url": "https://www.shad.ca/"
    },

    {
        "id": 3,
        "heading": "President",
        "company": "Fuego, A Junior Achievement Company",
        "description": "As the president of Fuego – a Junior Achievement Company – I oversaw all company sectors including: finance, marketing, HR. operations, and IT. Furthermore, I chaired meetings and directed overall company vision and strategy. Our company specialized in designing, producing, and selling color-changing mugs. Junior Achievement is a global non-profit youth organization that helps high school students build their own businesses.",
        "image": "Fuego.jpg",
        "url": "https://fuegojasa.wixsite.com/fuegomugs"
    },

    {
        "id": 4,
        "heading": "Participant",
        "company": "Technovation Challenge",
        "description": "As a participant of the Technovation Challenge 2017, I worked with my team and industry mentors to develop an app (DecidED) and startup (THinc) that matches high school students to post-secondary institutions and scholarships based on their interests, academics, and other profile information. During this 12 week challenge, I coded our mobile application using Thunckable and MIT App Inventor, conducted online market research, and wrote a full business plan for our venture.",
        "image": "Technovation.png",
        "url": "https://technovationchallenge.org/"
    },

    {
        "id": 5,
        "heading": "Co-founder and Web Designer",
        "company": "ITReliable",
        "description": "From 2016-2018, I ran a small Calgary-based IT services business: ITReliable. As the web designer, I designed, built and managed websites using WordPress, phpMyAdmin, and cPanel. I have created websites for all kinds of clients including renovators, restaurant owners, and accountants. In addition, I provided technical support and customer service for our clients.",
        "image": "ITReliable.png",
        "url": "https://www.itreliable.com/wp/"
    },

    {
        "id": 6,
        "heading": "Co-founder and President",
        "company": "Sir Winston Churchill LaunchX Club",
        "description": "Working with a friend and fellow student, we brought the international LaunchX program to my high school (Sir Winston Churchill Highschool). As the president of the club, I organized club meetings, taught entrepreneurship lessons provided by LaunchX, and guided our club members throughout their startup journey. Originally founded at MIT, the LaunchX program aims to empower high school students to build a viable startup by offering lessons, materials, and guidance for student companies.",
        "image": "SWCLaunchX.png",
        "url": "https://launchx.com/"
    },

    {
        "id": 7,
        "heading": "Developer",
        "company": "ProToGo Technologies Inc.",
        "description": "As one of the developers for ProToGo, a student-lead start up aimed at transforming the construction industry, I worked on building the first version of ProToGo’s web application. I focused on building front-end pages using Vue.js and connecting the Vue components to our back-end Firebase to store and reflect data.",
        "image": "ProToGo.png",
        "url": "https://www.protogo.co/"
    },

    {
        "id": 8,
        "heading": "First Year Representative",
        "company": "UBC BizTech",
        "description": "As a first-year representative for UBC BizTech, UBC’s largest tech club, I was responsible for assisting the partnerships director with contacting companies and finding sponsors. Additionally, I helped with organizing, planning, and running over 12 BizTech events throughout the school year. UBC BizTech is the largest technology club at the University of British Columbia. Focused on bringing together the fields of business and technology, UBC BizTech has over 280 members, who are intelligent, ambitious, and keen students ranging from many different faculties.",
        "image": "BizTech.png",
        "url": "https://www.ubcbiztech.com/"
    },

    {
        "id": 9,
        "heading": "Technical Project Coordinator Intern",
        "company": "SAP SE",
        "description": "As a technical project coordinator intern at SAP, I worked with a development team on the technical side, to build an internal training web-app used across SAP Canada with the MERN (MongoDB, Express, React, Node.js) stack. I focused on coding React components such as a data consent modal and implementing MongoDB endpoints such as storing a user’s training data. On the project-coordination side, I helped senior management make data driven decisions by creating multiple BI dashboards using SAP Analytics Cloud and SAP Predictive Analytics. Furthermore, I ensured the success of our customer adoption program by creating adoption benchmarks and a customer adoption maturity model validated by stakeholders.",
        "image": "SAP.jpg",
        "url": "https://www.sap.com/"
    },

    {
        "id": 10,
        "heading": "Marketing Director & Team Lead",
        "company": "UBC BizTech",
        "description": "During my time as a team lead and marketing director for UBC BizTech (UBC's largest tech club), I boosted our event turnout rates by 10% through implementing a new marketing strategy. This strategy was created by analyzing previous years’ event marketing data and identifying the trends and opportunities. Additionally, I lead a team of 5 to plan, organize, and run 14 successful events for 281 club members throughout the school year.",
        "image": "BizTech.png",
        "url": "https://www.ubcbiztech.com/"
    },

    {
        "id": 11,
        "heading": "C++ Software Engineer Intern",
        "company": "Electronic Arts (EA)",
        "description": "Joining as a software engineer intern on EA’s FIFA systems team, I helped ensure the success of FIFA 22 by working in areas including: memory management, collecting performance metrics, and improving crash diagnosis and automation tools. More specifically, I greatly enhanced the crash diagnosis process on PS4 and PS5 consoles by implementing the ability to provide, retrieve, and process valuable crash context information within FIFA’s crash reporting tool. Furthermore, I significantly improved the accuracy of memory reports by re-working the memory snapshot mechanism, allowing it to have a more precise timing. Lastly, I ensured the quality of FIFA 22 by fixing multiple critical bugs, adding features to our automation tools, and stabilizing automation cycles.",
        "image": "EA.png",
        "url": "https://www.ea.com/"
    },

    {
        "id": 12,
        "heading": "Web Developer",
        "company": "UBC Table Tennis Club",
        "description": "Working within a team of developers, I am responsible for leading front-end development and creating several web pages using Ruby on Rails, JavaScript, HTML, CSS and Bootstrap. In addition, I help other developers by assisting the back-end configuration of Heroku and PostgreSQL database, and troubleshooting any environment setup and front-end development issues.",
        "image": "UBCTTC.jpg",
        "url": "http://www.ubctabletennis.org/"
    },

    {
        "id": 13,
        "heading": "Software Engineer Intern",
        "company": "Microsoft",
        "description": "As a software engineer intern on Microsoft’s Azure Compute – OnePubSub Team, I worked on building a POC proxy server for our ZooKeeper service using C#, .NET Core 5.0, TCP sockets, SSL protocol, and Azure SLB. Designed to serve over 1000+ machines, this proxy significantly improved the connectivity, migration support, disaster recovery, and extendibility of Microsoft’s internal ZooKeeper service. Additionally, I worked with principal engineers to set the foundations of the proxy documentation by writing a detailed design document covering benefits, functional requirements, and architectural approach. Lastly, I evaluated the proxy’s performance by writing tests, measuring latency, and collecting telemetry.",
        "image": "Microsoft.png",
        "url": "https://www.microsoft.com"
    },

    {
        "id": 14,
        "heading": "Use the Timeline to See More Past Experiences!",
        "description": "Try clicking on \"2021\" to see what I did in the past.",
        "image": "Arrow.png",
        "url": "https://www.scheng.ca"
    },

    {
        "id": 15,
        "heading": "Software Engineer (2023 - Present)",
        "description": "I’m building and managing large scale distributed systems services (Kafka & Zookeeper) used across Azure and Microsoft at the foundational platform layer. These services run globally 24/7 with high availability and across 250+ availability zones. My work focuses on improving the fundamental quality, resiliency, security, and availability of these services. Outside of my team, I’m passionate about helping other early-in-career folks by organizing career discussions.",
        "image": "Microsoft.png",
        "url": "https://www.microsoft.com"
    },

    {
        "id": 16,
        "heading": "Use the Timeline to See More Past Experiences!",
        "description": "Try clicking on \"2022\" to see what I did in the past.",
        "image": "Arrow.png",
        "url": "https://www.scheng.ca"
    }
    
]